import { useMemo } from "react"

/**
 * ข่มใจเอาไว้
 * อย่าไปหลงมีใจ
 * ถึงเธอจะดีสักเท่าไหร่
 * ต้องไม่แคร์
 * อย่าไปยอมแพ้
 * ให้ความเหงาในใจ
 * เพราะไม่มีทางเป็นไปได้
 * ที่สองเราจะรักกัน
 * กดดันทุกครั้ง
 * ที่เราต้องมาใกล้ชิดกัน
 * ไม่รู้ทำไมหัวใจต้องสั่น
 * เพียงแค่เธอมองมา
 * เกลียดความหวั่นไหว
 * ที่ก่อตัวในใจฉัน
 * ให้ห้ามเท่าไหร่ใจยิ่งดึงดัน
 * ให้คิดถึงเธอ
 * เกลียดความหวั่นไหว
 * ที่ก่อตัวอยู่เสมอ
 * แค่เผลอมองตาก็พาให้ลืม
 * ตัวเองทุกครั้งมันไม่รู้ทำไม
 * เจ็บที่ต้องฝืน
 * ให้ไม่คิดอะไร
 * เพราะรู้ตัวดีต้องเสียใจ
 * ถ้าเผลอมีใจให้เธอ
 * กดดันทุกครั้ง (ฮูฮู้)
 * ที่เราต้องมาใกล้ชิดกัน
 * ไม่รู้ทำไมหัวใจต้องสั่น
 * เพียงแค่เธอมองมา
 * เกลียดความหวั่นไหว
 * ที่ก่อตัวในใจฉัน
 * ให้ห้ามเท่าไหร่ใจยิ่งดึงดัน
 * ให้คิดถึงเธอ
 * เกลียดความหวั่นไหว
 * ที่ก่อตัวอยู่เสมอ
 * แค่เผลอมองตาก็พาให้ลืม
 * ตัวเองทุกครั้งมันไม่รู้ทำไม
 * เกลียดความหวั่นไหว
 * ที่ก่อตัวในใจฉัน
 * ให้ห้ามเท่าไหร่ใจยิ่งดึงดัน
 * ให้คิดถึงเธอ
 * เกลียดความหวั่นไหว
 * ที่ก่อตัวอยู่เสมอ
 * แค่เผลอมองตาก็พาให้ลืม
 * ตัวเองทุกครั้งมันไม่รู้ทำไม
 *
 * @param input ข้อความที่หวั่นไหว
 * @returns ข้อความที่หวั่นไหวกว่า
 */
export function usePKazuya(input: string) {
  return useMemo(
    () =>
      input
        .split("")
        .map((char) => {
          return ("ิีึ์ุูั่้๊๋".includes(char) ? "" : " ") + char
        })
        .join("")
        .trim(),
    [input]
  )
}
